CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
/**
 * @file main.cpp
 * @brief Implementation of an ESP32-based sensor data logger and transmitter.
 *
 * This program is designed to collect data from sensors (e.g., PMS5003, DHT22), log the data in memory and on an SD card,
 * and transmit the data to a remote server using GSM/GPRS. The program supports JSON and CSV data formats for logging
 * and transmission. It also handles network time synchronization and manages failed data transmissions by retrying
 * them later.
 *
 * @details
 * - The program initializes the PMS5003 sensor, DHT22 sensor (if available), and GSM module (if available).
 * - Data is collected at regular intervals and logged in memory or on an SD card.
 * - Data is transmitted to a server at specified intervals.
 * - Failed transmissions are stored and retried later.
 * - The program uses the ArduinoJson library for JSON handling and the TimeLib library for time management.
 * - SD card operations are performed using a custom file handling API.
 *
 * @note The program assumes the presence of specific hardware components, including an SD card module, PMS5003 sensor,
 * and GSM module. It also assumes that the GSM module supports GPRS and can fetch network time.
 *
 * @author Gdieon Maina
 * @date 2025-06-13
 * @version 1.2.0
 *
 * @dependencies
 * - ArduinoJson
 * - TimeLib
 * - PMserial
 * - SD_handler
 * - GSM_handler
 * - dhtnew : https://github.com/RobTillaart/DHTNew
 *
 * @hardware
 * - ESP32 microcontroller
 * - PMS5003 sensor
 * - GSM module
 * - SD card module
 * - DHT22 sensor (optional)
 *
 * @todo
 * - Implement support for other network connections (e.g., WiFi, LoRa).
 * - Improve JSON validation logic.
 * - Add error handling for SD card operations.
 * - Optimize memory usage for large data sets.
 * - Improve time handling.
 * - Improve power management for battery-operated devices.
 */

#include "global_configs.h"
#include "helpers.h"
#include "PMserial.h"
#include "utils/SD_handler.h"
#include "utils/GSM_handler.h"
#include <TimeLib.h>
#include <ESP32Time.h>
#include <ArduinoJson.h>
#include "dhtnew.h"

DHTNEW dht(ONEWIRE_PIN);                           // DHT sensor, pin, type
SerialPM pms(PMS5003, PM_SERIAL_RX, PM_SERIAL_TX); // PMSx003, RX, TX
unsigned long act_milli;
unsigned long last_read_sensors_data = 0;
int sampling_interval = 5 * 60 * 1000; // 5 minutes
unsigned long starttime = 0;
unsigned sending_intervall_ms = 30 * 60 * 1000; // 30 minutes
unsigned long count_sends = 0;
char csv_header[255] = "timestamp,value_type,value,unit,sensor_type";

bool SD_Attached = false;

char ROOT_DIR[24] = {};
char BASE_SENSORS_DATA_DIR[20] = "/SENSORSDATA";
char CURRENT_SENSORS_DATA_DIR[128] = {};
char SENSORS_JSON_DATA_PATH[128] = {};
char SENSORS_CSV_DATA_PATH[128] = {};
char SENSORS_FAILED_DATA_SEND_STORE_FILE[40] = "failed_send_payloads.txt";
char SENSORS_FAILED_DATA_SEND_STORE_PATH[128] = {};

char esp_chipid[18] = {};

bool send_now = false;

ESP32Time RTC;
char time_buff[32] = {};
const char *ISO_time_format = "%Y-%m-%dT%H:%M:%S"; // ISO 8601 format
struct datetimetz
{
    tmElements_t datetime;
    time_t timestamp;
    char timezone[6] = {}; // e.g. +0300 // +03
} esp_datetime_tz;

enum SensorAPN_PIN
{
    PMS = PMS_API_PIN,
    DHT = 7
};

enum DATA_LOGGERS
{
    JSON,
    CSV
};

struct LOGGER
{
    const char *name;
    char *path;
    DATA_LOGGERS type;
    static const int MAX_ENTRIES = 48;
    static const int ENTRY_SIZE = 255;
    char DATA_STORE[MAX_ENTRIES][ENTRY_SIZE] = {};
    int log_count = 0;
} JSON_PAYLOAD_LOGGER, CSV_PAYLOAD_LOGGER;

void readDHT();
void getPMSREADINGS();
void printPM_values();
void printPM_Error();
void generateJSON_payload(char *res, JsonDocument &data, const char *timestamp, SensorAPN_PIN pin, size_t size);
bool sendData(const char *data, const int _pin, const char *host, const char *url);
datetimetz extractDateTime(String datetimeStr);
String formatDateTime(time_t t, String timezone);
String getRTCdatetimetz(const char *format, char *timezone);
void init_memory_loggers();
void init_SD_loggers();
void getMonthName(int month_num, char *month);
void readSendDelete(const char *datafile);
void initCalender(int year, int month);
void updateCalendarFromRTC();
void memoryDataLog(LOGGER &logger, const char *data);
void fileDataLog(LOGGER &logger);
void resetLogger(LOGGER &logger);
void sendFromMemoryLog(LOGGER &logger);

enum Month
{
    _JAN = 1,
    _FEB = 2,
    _MAR = 3,
    _APR = 4,
    _MAY = 5,
    _JUN = 6,
    _JUL = 7,
    _AUG = 8,
    _SEP = 9,
    _OCT = 10,
    _NOV = 11,
    _DEC = 12

};

int current_year, current_month = 0;

void setup()
{
    Serial.begin(115200);

    uint64_t chipid_num;
    chipid_num = ESP.getEfuseMac();
    snprintf(esp_chipid, sizeof(esp_chipid), "%llX", chipid_num);
    Serial.print("ESP32 Chip ID: ");
    Serial.println(esp_chipid);
    Serial.println("Initializing PMS5003 sensor");
    init_memory_loggers();
    pms.init();
    delay(2000);
    pms.sleep();
    dht.setType(DHTTYPE);

    if (gsm_capable)
    {
        if (GSM_Serial_begin())
        {

            if (!GSM_init())
            {
                Serial.println("GSM not fully configured");
                Serial.print("Failure point: ");
                Serial.println(GSM_INIT_ERROR);
                Serial.println();
                return;
            }
            else
            {
                GSM_CONNECTED = true;

                while (!register_to_network()) // ! INFINITE LOOP!
                {
                    Serial.println("Retrying network registration...");
                }

                // GPRS init

                if (!GPRS_init())
                {
                    Serial.println("Failed to init GPRS");
                }
                else
                {
                    Serial.println("GPRS initialized!");
                }

                if (getNetworkTime(time_buff))
                {

                    // update RTC time and calendar;
                    Serial.println("GSM Network Time: " + String(time_buff));
                    esp_datetime_tz = extractDateTime(String(time_buff));
                    RTC.setTime(esp_datetime_tz.timestamp);
                    initCalender(RTC.getYear(), RTC.getMonth() + 1);
                }
                else
                {
                    Serial.println("Failed to fetch time from network");
                }
            }

            GSM_sleep();
        }
        else
        {
            Serial.println("Could not communicate to GSM module.");
        }
    }

    else
    {
        // connectWifi();
        Serial.println("Support for other network connections not yet implemented");
    }

// SD INIT
#ifdef REASSIGN_PINS
    SPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (SD_Init(SD_CS))
    {
#else
    if (SD_Init(-1))
    {
#endif

        SD_Attached = SDattached();

        if (SD_Attached)
        {
            init_SD_loggers();
        }
    }

    starttime = millis();
}

// ToDo: introduce ESP light sleep mode
void loop()
{
    unsigned sum_send_time = 0;
    act_milli = millis();

