CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    CSV_PAYLOAD_LOGGER.name = "CSV";
    CSV_PAYLOAD_LOGGER.path = SENSORS_CSV_DATA_PATH;
    CSV_PAYLOAD_LOGGER.type = DATA_LOGGERS::CSV;
}

/// @brief Init directories for logging files
void init_SD_loggers()
{
    // Root directory
    strcpy(ROOT_DIR, "/");
    strcat(ROOT_DIR, SENSOR_PREFIX);
    strcat(ROOT_DIR, esp_chipid);
    createDir(SD, ROOT_DIR);

    if (current_year != 0 && current_month != 0)
    {
        char _year[4] = {};
        strcpy(CURRENT_SENSORS_DATA_DIR, ROOT_DIR);
        strcat(CURRENT_SENSORS_DATA_DIR, BASE_SENSORS_DATA_DIR);

        createDir(SD, CURRENT_SENSORS_DATA_DIR); // Create base sensor directory "/ESP_CHIP_ID/SENSORSDATA"

        itoa(current_year, _year, 10);
        strcat(CURRENT_SENSORS_DATA_DIR, "/");
        strcat(CURRENT_SENSORS_DATA_DIR, _year);

        createDir(SD, CURRENT_SENSORS_DATA_DIR); // Create year directory "/ESP_CHIP_ID/SENSORSDATA/2025"
    }

    else
    {
        Serial.println("Year or month not set");
        return;
    }

    memset(SENSORS_JSON_DATA_PATH, 0, sizeof(SENSORS_JSON_DATA_PATH));
    char month[3] = {};
    getMonthName(current_month, month);

    // Update sensors JSON data path
    strcpy(SENSORS_JSON_DATA_PATH, CURRENT_SENSORS_DATA_DIR);
    strcat(SENSORS_JSON_DATA_PATH, "/");
    strcat(SENSORS_JSON_DATA_PATH, month);
    strcat(SENSORS_JSON_DATA_PATH, ".txt");

    // Update sensors CSV data path
    strcpy(SENSORS_CSV_DATA_PATH, CURRENT_SENSORS_DATA_DIR);
    strcat(SENSORS_CSV_DATA_PATH, "/");
    strcat(SENSORS_CSV_DATA_PATH, month);
    strcat(SENSORS_CSV_DATA_PATH, ".csv");

    int _from = 0;
    int _to = 0;
    if (readLine(SD, SENSORS_CSV_DATA_PATH, _to, _from, true) != (String)csv_header)
    {
        appendFile(SD, SENSORS_CSV_DATA_PATH, csv_header);
    }

    // Init logger paths
    strcpy(SENSORS_FAILED_DATA_SEND_STORE_PATH, ROOT_DIR);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, BASE_SENSORS_DATA_DIR);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, "/");
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, SENSORS_FAILED_DATA_SEND_STORE_FILE);
    strcat(SENSORS_FAILED_DATA_SEND_STORE_PATH, "\0");

    // write files to SD
    // writeFile(SD, SENSORS_JSON_DATA_PATH, "");                   // create file if it does not exist
    // writeFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, ""); // create file if it does not exist

    // Debug runtime logger;
}

/**
    @brief convert number of month to name
    @param month_num : range from 1 to 12
    @param month : name of the month
    @return : void
**/
void getMonthName(int month_num, char *month)
{
    switch (month_num)
    {
    case (Month::_JAN):
        strcpy(month, "JAN");
        break;

    case (Month::_FEB):
        strcpy(month, "FEB");
        break;

    case (Month::_MAR):
        strcpy(month, "MAR");
        break;

    case (Month::_APR):
        strcpy(month, "APR");
        break;

    case (Month::_MAY):
        strcpy(month, "MAY");
        break;

    case (Month::_JUN):
        strcpy(month, "JUN");
        break;

    case (Month::_JUL):
        strcpy(month, "JUL");
        break;
    case (Month::_AUG):
        strcpy(month, "AUG");
        break;
    case (Month::_SEP):
        strcpy(month, "SEP");
        break;
    case (Month::_OCT):
        strcpy(month, "OCT");
        break;
    case (Month::_NOV):
        strcpy(month, "NOV");
        break;
    case (Month::_DEC):
        strcpy(month, "DEC");
        break;
    }
}

/// @brief : Read data from SD card and send it to the server
/// @param datafile : file name to read from
/// @return : void
/// @note : The function will read the data from the file and send it to the server. If the send fails, the data will be appended to a temporary file for later sending.
/// @note : The function will also update the file contents to remove the data that was sent successfully.
void readSendDelete(const char *datafile)
{
    String data;
    const char *tempFile = "/temp_sensor_payload.txt";

    Serial.println("Attempting to send data that previoudly failed to send.");

    int next_byte = -1;
    int next_line_index = 0;

    // readline continously
    do
    {

        data = readLine(SD, datafile, next_byte, next_line_index, false);

        if (next_byte == -1) // End of file reached
        {
            Serial.println("End of file read");
        }

        if (!validateJson(data.c_str()))
        {
            Serial.println("Invalid JSON data: " + data);
            continue;
        }

        if (data != "")
        {
            JsonDocument doc;
            deserializeJson(doc, data);        // Extract APN_PIN from the JSON data
            int api_pin = doc["APN_PIN"] | -1; // Default to -1 if not found

            if (api_pin == -1)
            {
                Serial.println("APN_PIN not found in JSON data ");
                continue; // Skip this data if API_PIN is not found
            }
            // Attempt send payload
            // Serial.println("Attempting to send data from SD card: " + data);
            if (!sendData(data.c_str(), api_pin, HOST_CFA, URL_CFA))
            {
                // store data in temp file
                appendFile(SD, tempFile, data.c_str(), true);
            }
        }
    } while (next_byte != -1);

    updateFileContents(SD, datafile, tempFile);

    // close files
    closeFile(SD, datafile);
}

void updateCalendarFromRTC()
{
    bool calendarUpdated = false;
    int year = RTC.getYear();
    int month = RTC.getMonth() + 1; // ESP32Time month is 0 based

    if (year > current_year)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_year);
        Serial.print(" to: ");
        Serial.println(year);

        current_year = year;
        current_month = month; // Also update the month. Ideally, Jan.
        calendarUpdated = true;
    }
    else if (month > current_month)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_month);
        Serial.print(" to: ");
        Serial.println(month);

        current_month = month;
        calendarUpdated = true;
    }
    if (calendarUpdated)
    {
        init_SD_loggers();
    }
}

void initCalender(int year, int month)
{
    Serial.print("Initializing calendar with year: ");
    Serial.print(year);
    Serial.print(" and month: ");
    Serial.println(month);
    if (year != 0 && month != 0)
    {
        current_year = year;
        current_month = month;
    }
}

/**
    @brief Log data to memory
    @param logger : logger to log the data to
    @param data : data to log
    @return : void
    @note : The function will log the data to the logger. If the logger is full, it will append the data to a file.
**/
void memoryDataLog(LOGGER &logger, const char *data)
{

