CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    if (logger.log_count < logger.MAX_ENTRIES)
    {
        strcpy(logger.DATA_STORE[logger.log_count], data);
        Serial.println("Logged data: " + String(logger.DATA_STORE[logger.log_count]));
        logger.log_count++;
    }
    else
    {
        Serial.println("Logger data log count exceeded for " + String(logger.name));
        switch (logger.type)
        {
        case DATA_LOGGERS::JSON:
            // Append to JSON file
            fileDataLog(logger);
            send_now = true;
            break;
        case DATA_LOGGERS::CSV:
            fileDataLog(logger);
            resetLogger(logger);
            break;
        }
    }
}

/**
    @brief Log data to file
    @param logger : logger to log the data to
    @return : void
    @note : The function will log the data to the file. If the file is full, it will append the data to a new file.
**/
void fileDataLog(LOGGER &logger)
{
    Serial.println("Logging data to file: " + String(logger.path));
    for (int i = 0; i < logger.MAX_ENTRIES; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            appendFile(SD, logger.path, logger.DATA_STORE[i]);
        }
    }
}

/**
    @brief Reset logger
    @param logger : logger to reset
    @return : void
    @note : The function will reset the logger. It will clear the data store and set the log count to 0.
**/
void resetLogger(LOGGER &logger)
{
    logger.log_count = 0;
    memset(logger.DATA_STORE, 0, sizeof(logger.DATA_STORE));
}

/**
    @brief Send data from memory loggers
    @param logger : logger to send data from
    @return : void
    @note : The function will send the data from the logger. If the send fails, the data will be appended to a file for later sending.
**/
void sendFromMemoryLog(LOGGER &logger)
{
    for (int i = 0; i < logger.log_count; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            if (!sendData(logger.DATA_STORE[i], PMS_API_PIN, HOST_CFA, URL_CFA))
            {
                // Append to file for sending later
                appendFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, logger.DATA_STORE[i]);
            }
            memset(logger.DATA_STORE[i], '\0', 255);
        }
    }
    logger.log_count = 0;

    //? call resetLogger(logger) to reset the logger
    //? or just clear the memory
}
